// DrvFunc.cpp: implementation of the ProcPacket class.
//
//////////////////////////////////////////////////////////////////////

#include "DrvFunc.h"


/**
 *	根据驱动器名，获取 device name
 */
BOOLEAN drvfunc_query_device_name( IN OUT LPSTDRIVERINFO pstDriverInfo )
{
	//
	//	INPUT:
	//		pstDriverInfo->uszDosDriverLetter	"C:"
	//
	//	OUTPUT:
	//		pstDriverInfo->wszDosFullDriverLetter	L"\\??\\C:"
	//		pstDriverInfo->uszDeviceName		"\\Device\\HarddiskVolume1"
	//		pstDriverInfo->wszDeviceName		L"\\Device\\HarddiskVolume1"
	//

	BOOLEAN bRet;
	NTSTATUS ntStatus = STATUS_UNSUCCESSFUL; 
	HANDLE hLink;
	UNICODE_STRING usSymbolLink;
	UNICODE_STRING usLinkName;
	OBJECT_ATTRIBUTES attributes;
	PWCHAR pwsSymbolLink;
	ULONG nReturnLen;


	if ( NULL == pstDriverInfo )
	{
		return FALSE;
	}
	if ( 0 == pstDriverInfo->uszDosDriverLetter[0] )
	{
		return FALSE;
	}

	//	...
	bRet = FALSE;

	__try
	{
		pwsSymbolLink = (PWCHAR)ExAllocatePool( NonPagedPool, MAX_PATH );
		if ( pwsSymbolLink )
		{
			RtlZeroMemory( pwsSymbolLink, MAX_PATH );
			RtlInitEmptyUnicodeString( &usSymbolLink, pwsSymbolLink, MAX_PATH );
			usSymbolLink.Length	= 0;

			wcscpy( pstDriverInfo->wszDosFullDriverLetter, L"\\??\\A:" );
			ntStatus = drvfunc_c2w( pstDriverInfo->uszDosDriverLetter, pstDriverInfo->wszDosFullDriverLetter + 4, sizeof(pstDriverInfo->wszDosFullDriverLetter) - 4 * sizeof(WCHAR) );
			if ( NT_SUCCESS( ntStatus ) )
			{
				RtlInitUnicodeString( &usLinkName, pstDriverInfo->wszDosFullDriverLetter );

			//	This case is supported on Windows XP/2003 and later operating system versions
			stVersionInfo.dwOSVersionInfoSize = sizeof( RTL_OSVERSIONINFOW );
			ntStatus = RtlGetVersion( &stVersionInfo );

			if ( NT_SUCCESS( ntStatus ) )
			{
				*pOsMajorVersion = stVersionInfo.dwMajorVersion;
				*pOsMinorVersion = stVersionInfo.dwMinorVersion;
				KdPrint( ("drvfunc_get_os_version::RtlGetVersion successfully.\n") );
			}
			else
			{
				KdPrint( ("drvfunc_get_os_version::RtlGetVersion failed.\n") );
			}
		#else
			//	This case is supported on Windows 2000/98/me versions of the operating system
			PsGetVersion( pOsMajorVersion, pOsMinorVersion, NULL, NULL );
			// ..
			ntStatus = STATUS_SUCCESS;
			KdPrint( ("drvfunc_get_os_version::PsGetVersion successfully.\n") );
		#endif
	}
	__except ( EXCEPTION_EXECUTE_HANDLER )
	{
		KdPrint(("EXCEPTION_EXECUTE_HANDLER in: drvfunc_get_os_version"));
	}

	return ntStatus;
}


/////////////////////////////////////////////////////////////////
// 取得进程偏移量
ULONG drvfunc_get_processname_offset()
{
	ULONG uRet;
	ULONG i;
	PEPROCESS stCurProc;

	uRet	= 0;

	__try
	{
		stCurProc = PsGetCurrentProcess();

		//
		//	Scan for 12KB, hoping the KPEB never grows that big!
		//	PAGE_SIZE=4k/8k
		//
		for ( i = 0; i < 3 * PAGE_SIZE; i ++ )
		{
			if ( ! strncmp( SYSNAME, (PCHAR)stCurProc + i, strlen(SYSNAME) ) )
			{
				uRet = i;
				break;
			}
		}
	}
	__except( EXCEPTION_EXECUTE_HANDLER )
	{
		KdPrint(("EXCEPTION_EXECUTE_HANDLER in: drvfunc_get_processname_offset"));
	}
	
	return uRet;
}

/**
 *	获取进程名
 *	取得当前进程名,不带路径（例:notepad.exe）
 */
BOOLEAN drvfunc_get_processname( IN ULONG uProcessNameOffset, OUT PCHAR pProcessName, IN ULONG uSize )
{
	//
	//	pProcessName	- [out] Pointer to get the process name, etc: "notepad.exe".
	//

	PEPROCESS       stCurProc;
	char            *nameptr;
	ULONG           i;

	//
	// We only do this if we determined the process name offset
	//
	if ( 0 == uProcessNameOffset )
	{
		return FALSE;
	}

	__try
	{
		//
		// Get a pointer to the current process block
		//
		stCurProc = PsGetCurrentProcess();
		
		//
		// Dig into it to extract the name. Make sure to leave enough room
		// in the buffer for the appended process ID.
		//
		nameptr   = (PCHAR)stCurProc + uProcessNameOffset;

		//..
		_snprintf( pProcessName, uSize/sizeof(char)-1, "%s", nameptr );
	}
	__except( EXCEPTION_EXECUTE_HANDLER )
	{
		KdPrint(("EXCEPTION_EXECUTE_HANDLER in: drvfunc_get_processname"));
	}

	return TRUE;
}

/////////////////////////////////////////////////////////////////
//  类别:
//         文件系统操作
//  功能:
//         取得当前进程名完整路径名（例:C:\WINNT\notepad.exe）
//  参数：
//         
//  返回值：
//         STATUS_SUCCESS	成功
//  原理：取得 EPROCESS->PEB->RTL_USER_PROCESS_PARAMETER->ImagePathName
//	  从这原理也可以取出Command Line
/*
  PEPROCESS should be a pointer to _EPROCESS structure.
  I don't think the definition of _EPROCESS is available for public.
  A simple debug in XP SP1 gives me following attributes:
  --------------------------------------------------------------------------------
   +0x000 Pcb              : _KPROCESS
   +0x06c ProcessLock      : _EX_PUSH_LOCK
   +0x070 CreateTime       : _LARGE_INTEGER
   +0x078 ExitTime         : _LARGE_INTEGER
   +0x080 RundownProtect   : _EX_RUNDOWN_REF
   +0x084 UniqueProcessId  : Ptr32 Void
   +0x088 ActiveProcessLinks : _LIST_ENTRY
   +0x090 QuotaUsage       : [3] Uint4B
   +0x09c QuotaPeak        : [3] Uint4B
   +0x0a8 CommitCharge     : Uint4B
   +0x0ac PeakVirtualSize  : Uint4B
   +0x0b0 VirtualSize      : Uint4B
   +0x0b4 SessionProcessLinks : _LIST_ENTRY
   +0x0bc DebugPort        : Ptr32 Void
   +0x0c0 ExceptionPort    : Ptr32 Void
   +0x0c4 ObjectTable      : Ptr32 _HANDLE_TABLE
   +0x0c8 Token            : _EX_FAST_REF
   +0x0cc WorkingSetLock   : _FAST_MUTEX
   +0x0ec WorkingSetPage   : Uint4B
   +0x0f0 AddressCreationLock : _FAST_MUTEX
   +0x110 HyperSpaceLock   : Uint4B
   +0x114 ForkInProgress   : Ptr32 _ETHREAD
   +0x118 HardwareTrigger  : Uint4B
   +0x11c VadRoot          : Ptr32 Void
   +0x120 VadHint          : Ptr32 Void
   +0x124 CloneRoot        : Ptr32 Void
   +0x128 NumberOfPrivatePages : Uint4B
   +0x12c NumberOfLockedPages : Uint4B
   +0x130 Win32Process     : Ptr32 Void
   +0x134 Job              : Ptr32 _EJOB
   +0x138 SectionObject    : Ptr32 Void
   +0x13c SectionBaseAddress : Ptr32 Void
   +0x140 QuotaBlock       : Ptr32 _EPROCESS_QUOTA_BLOCK
   +0x144 WorkingSetWatch  : Ptr32 _PAGEFAULT_HISTORY
   +0x148 Win32WindowStation : Ptr32 Void
   +0x14c InheritedFromUniqueProcessId : Ptr32 Void
   +0x150 LdtInformation   : Ptr32 Void
   +0x154 VadFreeHint      : Ptr32 Void
   +0x158 VdmObjects       : Ptr32 Void
   +0x15c DeviceMap        : Ptr32 Void
   +0x160 PhysicalVadList  : _LIST_ENTRY
   +0x168 PageDirectoryPte : _HARDWARE_PTE
   +0x168 Filler           : Uint8B
   +0x170 Session          : Ptr32 Void
   +0x174 ImageFileName    : [16] UChar
   +0x184 JobLinks         : _LIST_ENTRY
   +0x18c LockedPagesList  : Ptr32 Void
   +0x190 ThreadListHead   : _LIST_ENTRY
   +0x198 SecurityPort     : Ptr32 Void
   +0x19c PaeTop           : Ptr32 Void
   +0x1a0 ActiveThreads    : Uint4B
   +0x1a4 GrantedAccess    : Uint4B
   +0x1a8 DefaultHardErrorProcessing : Uint4B
   +0x1ac LastThreadExitStatus : Int4B
   +0x1b0 Peb              : Ptr32 _PEB
   +0x1b4 PrefetchTrace    : _EX_FAST_REF
   +0x1b8 ReadOperationCount : _LARGE_INTEGER
   +0x1c0 WriteOperationCount : _LARGE_INTEGER
   +0x1c8 OtherOperationCount : _LARGE_INTEGER
   +0x1d0 ReadTransferCount : _LARGE_INTEGER
   +0x1d8 WriteTransferCount : _LARGE_INTEGER
   +0x1e0 OtherTransferCount : _LARGE_INTEGER
   +0x1e8 CommitChargeLimit : Uint4B
   +0x1ec CommitChargePeak : Uint4B
   +0x1f0 AweInfo          : Ptr32 Void
   +0x1f4 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
   +0x1f8 Vm               : _MMSUPPORT
   +0x238 LastFaultCount   : Uint4B
   +0x23c ModifiedPageCount : Uint4B
   +0x240 NumberOfVads     : Uint4B
   +0x244 JobStatus        : Uint4B
   +0x248 Flags            : Uint4B
   +0x248 CreateReported   : Pos 0, 1 Bit
   +0x248 NoDebugInherit   : Pos 1, 1 Bit
   +0x248 ProcessExiting   : Pos 2, 1 Bit
   +0x248 ProcessDelete    : Pos 3, 1 Bit
   +0x248 Wow64SplitPages  : Pos 4, 1 Bit
   +0x248 VmDeleted        : Pos 5, 1 Bit
   +0x248 OutswapEnabled   : Pos 6, 1 Bit
   +0x248 Outswapped       : Pos 7, 1 Bit
   +0x248 ForkFailed       : Pos 8, 1 Bit
   +0x248 HasPhysicalVad   : Pos 9, 1 Bit
   +0x248 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x248 SetTimerResolution : Pos 12, 1 Bit
   +0x248 BreakOnTermination : Pos 13, 1 Bit
   +0x248 SessionCreationUnderway : Pos 14, 1 Bit
   +0x248 WriteWatch       : Pos 15, 1 Bit
   +0x248 ProcessInSession : Pos 16, 1 Bit
   +0x248 OverrideAddressSpace : Pos 17, 1 Bit
   +0x248 HasAddressSpace  : Pos 18, 1 Bit
   +0x248 LaunchPrefetched : Pos 19, 1 Bit
   +0x248 InjectInpageErrors : Pos 20, 1 Bit
   +0x248 VmTopDown        : Pos 21, 1 Bit
   +0x248 Unused3          : Pos 22, 1 Bit
   +0x248 Unused4          : Pos 23, 1 Bit
   +0x248 VdmAllowed       : Pos 24, 1 Bit
   +0x248 Unused           : Pos 25, 5 Bits
   +0x248 Unused1          : Pos 30, 1 Bit
   +0x248 Unused2          : Pos 31, 1 Bit
   +0x24c ExitStatus       : Int4B
   +0x250 NextPageColor    : Uint2B
   +0x252 SubSystemMinorVersion : UChar
   +0x253 SubSystemMajorVersion : UChar
   +0x252 SubSystemVersion : Uint2B
   +0x254 PriorityClass    : UChar
   +0x255 WorkingSetAcquiredUnsafe : UChar
   +0x258 Cookie           : Uint4B
*/
BOOLEAN drvfunc_get_processfullname( OUT PCHAR pszFullProcessName, IN ULONG uSize, OUT USHORT * puFullnameLength )
{
	BOOLEAN  bRet;
	NTSTATUS ntStatus;
	ULONG uOsMajorVersion = 0;
	ULONG uOsMinorVersion = 0;
//	WCHAR wszProName[ MAX_PATH ] = {0};
	UNICODE_STRING usSource;
	ANSI_STRING asDest;
#if AMD64
	__int64 dwAddress = 0;
#else
	DWORD dwAddress = 0;
#endif

//	if ( KeGetCurrentIrql() > DISPATCH_LEVEL )
//	{
//		return FALSE;
//	}
	if ( PASSIVE_LEVEL != KeGetCurrentIrql() )
	{
		return FALSE;
	}

	KdPrint( ("drvfunc_get_processfullname:: enter...") );

	//	...
	bRet = FALSE;

	__try
	{
		ntStatus = drvfunc_get_os_version( &uOsMajorVersion, &uOsMinorVersion );
		if ( NT_SUCCESS( ntStatus )  )
		{
			#if AMD64
				dwAddress = (__int64)PsGetCurrentProcess();
			#else
				dwAddress = (DWORD)PsGetCurrentProcess();
			#endif
			if ( dwAddress > 0 && 0xFFFFFFFF != dwAddress )
			{
				//	目前只支持 Win 2000/xp/2003
